<a href="https://colab.research.google.com/github/pranali-kirolkar/MSCPROJECT/blob/main/demo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

importing dataset

In [4]:
Dataset = pd.read_csv('//content/Sales Summer Clothes... (Responses) - Form Responses.csv') 
Dataset

              Timestamp                     Name  ... any worst experience Rating
0        04-08-21 19:06                 Bhairavi  ...                   No  4 STAR
1        04-08-21 19:11                   Girish  ...                  Yes  3 STAR
2        04-08-21 19:17            Mayuri katkar  ...                  Yes  3 STAR
3        04-08-21 19:17                 Harshali  ...                  Yes  4 STAR
4        04-08-21 19:20  Sadamast Nikita Shivaji  ...                   No  5 STAR
..                  ...                      ...  ...                  ...     ...
197  4/27/2021 11:00:23                   Rekha   ...                   No  5 STAR
198  4/27/2021 11:00:47           Vaishali kokre  ...                   No  5 STAR
199  4/27/2021 11:01:10                   Neeta   ...                   No  5 STAR
200  4/27/2021 11:01:37                 Sushant   ...                   No  4 STAR
201  4/27/2021 11:03:00                  Suchita  ...                  Yes  1 STAR

[202 rows x 12 columns]

In [5]:
Dataset.head()

        Timestamp                     Name  ... any worst experience Rating
0  04-08-21 19:06                 Bhairavi  ...                   No  4 STAR
1  04-08-21 19:11                   Girish  ...                  Yes  3 STAR
2  04-08-21 19:17            Mayuri katkar  ...                  Yes  3 STAR
3  04-08-21 19:17                 Harshali  ...                  Yes  4 STAR
4  04-08-21 19:20  Sadamast Nikita Shivaji  ...                   No  5 STAR

[5 rows x 12 columns]

In [6]:
Dataset.tail()

              Timestamp            Name  ... any worst experience Rating
197  4/27/2021 11:00:23          Rekha   ...                   No  5 STAR
198  4/27/2021 11:00:47  Vaishali kokre  ...                   No  5 STAR
199  4/27/2021 11:01:10          Neeta   ...                   No  5 STAR
200  4/27/2021 11:01:37        Sushant   ...                   No  4 STAR
201  4/27/2021 11:03:00         Suchita  ...                  Yes  1 STAR

[5 rows x 12 columns]

In [7]:
Dataset.columns

Index(['Timestamp', 'Name', 'Age', 'buy clothes', 'Type of clothes ',
       'Brand of clothes', 'Price of clothes', 'time_prefer ',
       ' prefer purchasing ', 'compare prices ', 'any worst experience',
       'Rating '],
      dtype='object')

In [8]:
Dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 202 entries, 0 to 201
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Timestamp             202 non-null    object
 1   Name                  202 non-null    object
 2   Age                   202 non-null    object
 3   buy clothes           202 non-null    object
 4   Type of clothes       202 non-null    object
 5   Brand of clothes      202 non-null    object
 6   Price of clothes      202 non-null    object
 7   time_prefer           202 non-null    object
 8    prefer purchasing    202 non-null    object
 9   compare prices        202 non-null    object
 10  any worst experience  202 non-null    object
 11  Rating                202 non-null    object
dtypes: object(12)
memory usage: 19.1+ KB

In [9]:
Dataset.isnull()

     Timestamp   Name    Age  ...  compare prices   any worst experience  Rating
0        False  False  False  ...            False                 False    False
1        False  False  False  ...            False                 False    False
2        False  False  False  ...            False                 False    False
3        False  False  False  ...            False                 False    False
4        False  False  False  ...            False                 False    False
..         ...    ...    ...  ...              ...                   ...      ...
197      False  False  False  ...            False                 False    False
198      False  False  False  ...            False                 False    False
199      False  False  False  ...            False                 False    False
200      False  False  False  ...            False                 False    False
201      False  False  False  ...            False                 False    False

[202 rows x 12 columns]

In [10]:
Dataset.isnull().sum()

Timestamp               0
Name                    0
Age                     0
buy clothes             0
Type of clothes         0
Brand of clothes        0
Price of clothes        0
time_prefer             0
 prefer purchasing      0
compare prices          0
any worst experience    0
Rating                  0
dtype: int64

In [11]:
Dataset.describe()

             Timestamp     Name  ... any worst experience Rating
count              202      202  ...                  202     202
unique             177      196  ...                    2       5
top     04-10-21 16:32  Ashwini  ...                   No  5 STAR
freq                 3        2  ...                  133     140

[4 rows x 12 columns]

In [12]:
round(Dataset.describe())

             Timestamp     Name  ... any worst experience Rating
count              202      202  ...                  202     202
unique             177      196  ...                    2       5
top     04-10-21 16:32  Ashwini  ...                   No  5 STAR
freq                 3        2  ...                  133     140

[4 rows x 12 columns]

In [ ]:
from google.colab import drive
drive.mount('/content/drive')